const Point_1 = [
  { point: "2" },
  { point: "3" },
  { point: "2" },
  { point: "3" },
  { point: "3" },
  { point: "2" },
  { point: "3" },
  { point: "2" },
  { point: "2" },
];
const Point_2 = [
  { point: "1" },
  { point: "2" },
  { point: "1" },
  { point: "2" },
  { point: "2" },
  { point: "1" },
  { point: "2" },
  { point: "1" },
  { point: "1" },
];
const Point_3 = [
  { point: "1" },
  { point: "1" },
  { point: "1" },
  { point: "2" },
  { point: "2" },
  { point: "1" },
  { point: "2" },
  { point: "1" },
  { point: "1" },
];

export const TabsSanbox = [
  {
    key: "สัตวแพทย์",
    label: "สัตวแพทย์",
    icon: "schema",
    color: "gray",
    points: Point_1,
  },
  {
    key: "นักเทคนิคการแพทย์",
    label: "นักเทคนิคการแพทย์",
    icon: "schema",
    color: "gray",
    points: Point_1,
  },
  {
    key: "นักพัฒนาระบบ",
    label: "นักพัฒนาระบบ",
    icon: "schema",
    color: "gray",
    points: Point_1,
  },
  {
    key: "นักการเงินและบัญชี",
    label: "นักการเงินและบัญชี",
    icon: "schema",
    color: "gray",
    points: Point_1,
  },

  {
    key: "นักประชาสัมพันธ์",
    label: "นักประชาสัมพันธ์",
    icon: "schema",
    color: "gray",
    points: Point_1,
  },

  {
    key: "นักจัดการงานทั่วไป",
    label: "นักจัดการงานทั่วไป",
    icon: "schema",
    color: "gray",
    points: Point_1,
  },

  {
    key: "เจ้าหน้าที่สำนักงาน",
    label: "เจ้าหน้าที่สำนักงาน",
    icon: "schema",
    color: "gray",
    points: Point_2,
  },

  {
    key: "พนักงานบริการทั่วไป",
    label: "พนักงานบริการทั่วไป",
    icon: "schema",
    color: "gray",
    points: Point_3,
  },
];

export const Menus = [
  {
    key: "ความรับผิดชอบ ตรงต่อเวลา การรักษาระเบียบวินัย ",
    label: "1. ความรับผิดชอบ ตรงต่อเวลา การรักษาระเบียบวินัย ",
  },
  {
    key: "ความตั้งใจในการทำงาน",
    label: "2. ความตั้งใจในการทำงาน",
  },
  {
    key: "มนุษย์สัมพันธ์และการทำงานร่วมกับผู้อื่น",
    label: "3. มนุษย์สัมพันธ์และการทำงานร่วมกับผู้อื่น",
  },
  {
    key: "ความมีน้ำใจ",
    label: "4. ความมีน้ำใจ",
  },
  {
    key: "การร่วมมือในกิจกรรมของส่วนรวม",
    label: "5. การร่วมมือในกิจกรรมของส่วนรวม",
  },
];

export const Menus_9 = [
  {
    key: "การมุ่งผลสัมฤทธิ์",
    label: "1. การมุ่งผลสัมฤทธิ์",
  },
  {
    key: "บริการที่ดี",
    label: "2. บริการที่ดี",
  },
  {
    key: "การสั่งสมความเชี่ยวชาญในงานอาชีพ",
    label: "3. การสั่งสมความเชี่ยวชาญในงานอาชีพ",
  },
  {
    key: "การยึดมั่นในความถูกต้องชอบธรรมและจริยธรรม",
    label: "4. การยึดมั่นในความถูกต้องชอบธรรมและจริยธรรม",
  },
  {
    key: "การทำงานเป็นทีม",
    label: "5. การทำงานเป็นทีม",
  },
  {
    key: "การคิดวิเคราะห์",
    label: "1. การคิดวิเคราะห์",
  },
  {
    key: "การตรวจสอบความถูกต้องตามกระบวนงาน",
    label: "2. การตรวจสอบความถูกต้องตามกระบวนงาน",
  },
  {
    key: "การสืบเสาะหาข้อมูล",
    label: "3. การสืบเสาะหาข้อมูล",
  },
  {
    key: "การมองภาพองค์รวม",
    label: "4. การมองภาพองค์รวม",
  },
];

export const Groups = [
  {
    key: "ศูนย์ดูแลสัตว์เลี้ยง",
    label: "ศูนย์ดูแลสัตว์เลี้ยง",
    icon: "public",
    color: "blue",
  },
  {
    key: "ศูนย์เฝ้าระวังสุขภาพหนึ่งเดียว",
    label: "ศูนย์เฝ้าระวังสุขภาพหนึ่งเดียว",
    icon: "science",
    color: "purple",
  },
  {
    key: "ศูนย์ฝึกสัตวแพทย์และฟาร์มทดลอง",
    label: "ศูนย์ฝึกสัตวแพทย์และฟาร์มทดลอง",
    icon: "school",
    color: "indigo",
  },
  {
    key: "ศูนย์ความเป็นเลิศด้านเวชศาสตร์แมว",
    label: "ศูนย์ความเป็นเลิศด้านเวชศาสตร์แมว",
    icon: "groups",
    color: "pink",
  },
  {
    key: "ศูนย์สัตวแพทย์สาธารณสุขและอาหารปลอดภัย",
    label: "ศูนย์สัตวแพทย์สาธารณสุขและอาหารปลอดภัย",
    icon: "groups",
    color: "red",
  },
];
