const Point_1 = [
  { point: "2" },
  { point: "3" },
  { point: "2" },
  { point: "3" },
  { point: "3" },
  { point: "2" },
  { point: "3" },
  { point: "2" },
  { point: "2" },
];
const Point_2 = [
  { point: "1" },
  { point: "2" },
  { point: "1" },
  { point: "2" },
  { point: "2" },
  { point: "1" },
  { point: "2" },
  { point: "1" },
  { point: "1" },
];
const Point_3 = [
  { point: "1" },
  { point: "1" },
  { point: "1" },
  { point: "2" },
  { point: "2" },
  { point: "1" },
  { point: "2" },
  { point: "1" },
  { point: "1" },
];

export const Tabs = [
  // {
  //   key: "ทั้งหมด",
  //   label: "ทั้งหมด",
  //   icon: "list",
  //   color: "gray",
  //   points: [],
  // },
  {
    key: "นักการเงินและบัญชี",
    label: "นักการเงินและบัญชี",
    icon: "work",
    color: "gray",
    points: Point_1,
  },
  {
    key: "นักบริหารงานการศึกษา",
    label: "นักบริหารงานการศึกษา",
    icon: "work",
    color: "gray",
    points: Point_1,
  },
  {
    key: "นักบริหารงานทั่วไป",
    label: "นักบริหารงานทั่วไป",
    icon: "work",
    color: "gray",
    points: Point_1,
  },

  {
    key: "นักวิชาการคอมพิวเตอร์",
    label: "นักวิชาการคอมพิวเตอร์",
    icon: "work",
    color: "gray",
    points: Point_1,
  },
  {
    key: "นักวิเคราะห์นโยบายและแผน",
    label: "นักวิเคราะห์นโยบายและแผน",
    icon: "work",
    color: "gray",
    points: Point_1,
  },
  {
    key: "นักบริหารงานวิจัย",
    label: "นักบริหารงานวิจัย",
    icon: "work",
    color: "gray",
    points: Point_1,
  },
  {
    key: "นักทรัพยากรบุคคล",
    label: "นักทรัพยากรบุคคล",
    icon: "work",
    color: "gray",
    points: Point_1,
  },
  {
    key: "นักกิจการนักศึกษา",
    label: "นักกิจการนักศึกษา",
    icon: "work",
    color: "gray",
    points: Point_1,
  },
  {
    key: "นักประชาสัมพันธ์",
    label: "นักประชาสัมพันธ์",
    icon: "work",
    color: "gray",
    points: Point_1,
  },
  {
    key: "นักบริหารเทคโนโลยีการศึกษา",
    label: "นักบริหารเทคโนโลยีการศึกษา",
    icon: "work",
    color: "gray",
    points: Point_1,
  },
  {
    key: "นักจิตวิทยา",
    label: "นักจิตวิทยา",
    icon: "work",
    color: "gray",
    points: Point_1,
  },
  {
    key: "นักวิเทศสัมพันธ์",
    label: "นักวิเทศสัมพันธ์",
    icon: "work",
    color: "gray",
    points: Point_1,
  },
  {
    key: "นักจัดการงานทั่วไป",
    label: "นักจัดการงานทั่วไป",
    icon: "work",
    color: "gray",
    points: Point_1,
  },
  {
    key: "นักบริหารงานพัสดุ",
    label: "นักบริหารงานพัสดุ",
    icon: "work",
    color: "gray",
    points: Point_1,
  },
  {
    key: "วิศวกร",
    label: "วิศวกร",
    icon: "work",
    color: "gray",
    points: Point_1,
  },
  {
    key: "เจ้าหน้าที่สำนักงาน",
    label: "เจ้าหน้าที่สำนักงาน",
    icon: "work",
    color: "gray",
    points: Point_2,
  },
  {
    key: "พนักงานช่าง",
    label: "พนักงานช่าง",
    icon: "work",
    color: "gray",
    points: Point_2,
  },
  {
    key: "พนักงานบริการฝีมือ (ด้านเทคนิคและเครื่องยนต์)",
    label: "พนักงานบริการฝีมือ (ด้านเทคนิคและเครื่องยนต์)",
    icon: "work",
    color: "gray",
    points: Point_3,
  },
  {
    key: "พนักงานบริการฝีมือ (ด้านวิทยาศาสตร์และการแพทย์)",
    label: "พนักงานบริการฝีมือ (ด้านวิทยาศาสตร์และการแพทย์)",
    icon: "work",
    color: "gray",
    points: Point_3,
  },
  {
    key: "พนักงานบริการทั่วไป",
    label: "พนักงานบริการทั่วไป",
    icon: "work",
    color: "gray",
    points: Point_3,
  },
];

export const Menus = [
  {
    key: "การมุ่งผลสัมฤทธิ์",
    label: "1. การมุ่งผลสัมฤทธิ์",
  },
  {
    key: "บริการที่ดี",
    label: "2. บริการที่ดี",
  },
  {
    key: "การสั่งสมความเชี่ยวชาญในงานอาชีพ",
    label: "3. การสั่งสมความเชี่ยวชาญในงานอาชีพ",
  },
  {
    key: "การยึดมั่นในความถูกต้องชอบธรรมและจริยธรรม",
    label: "4. การยึดมั่นในความถูกต้องชอบธรรมและจริยธรรม",
  },
  {
    key: "การทำงานเป็นทีม",
    label: "5. การทำงานเป็นทีม",
  },
  {
    key: "การคิดวิเคราะห์",
    label: "1. การคิดวิเคราะห์",
  },
  {
    key: "การตรวจสอบความถูกต้องตามกระบวนงาน",
    label: "2. การตรวจสอบความถูกต้องตามกระบวนงาน",
  },
  {
    key: "การสืบเสาะหาข้อมูล",
    label: "3. การสืบเสาะหาข้อมูล",
  },
  {
    key: "การมองภาพองค์รวม",
    label: "4. การมองภาพองค์รวม",
  },
];

export const Menus_board = [
  {
    key: "การมุ่งผลสัมฤทธิ์",
    label: "1. การมุ่งผลสัมฤทธิ์",
  },
  {
    key: "บริการที่ดี",
    label: "2. บริการที่ดี",
  },
  {
    key: "การสั่งสมความเชี่ยวชาญในงานอาชีพ",
    label: "3. การสั่งสมความเชี่ยวชาญในงานอาชีพ",
  },
  {
    key: "การยึดมั่นในความถูกต้องชอบธรรมและจริยธรรม",
    label: "4. การยึดมั่นในความถูกต้องชอบธรรมและจริยธรรม",
  },
  {
    key: "การทำงานเป็นทีม",
    label: "5. การทำงานเป็นทีม",
  },
  {
    key: "การคิดวิเคราะห์",
    label: "1. การคิดวิเคราะห์",
  },
  {
    key: "การตรวจสอบความถูกต้องตามกระบวนงาน",
    label: "2. การตรวจสอบความถูกต้องตามกระบวนงาน",
  },
  {
    key: "การสืบเสาะหาข้อมูล",
    label: "3. การสืบเสาะหาข้อมูล",
  },
  {
    key: "การมองภาพองค์รวม",
    label: "4. การมองภาพองค์รวม",
  },
  {
    key: "ความรู้เกี่ยวกับงานในหน้าที่ กฎ ระเบียบที่เกี่ยวข้องในงาน",
    label: "1. ความรู้เกี่ยวกับงานในหน้าที่ กฎ ระเบียบที่เกี่ยวข้องในงาน",
  },
  {
    key: "ความรวดเร็วของงานที่ได้ปฏิบัติหรือได้รับมอบหมาย",
    label: "2. ความรวดเร็วของงานที่ได้ปฏิบัติหรือได้รับมอบหมาย",
  },
  {
    key: "ความถูกต้องของงานที่ได้ปฎิบัติหรือได้รับมอบหมาย",
    label: "3. ความถูกต้องของงานที่ได้ปฎิบัติหรือได้รับมอบหมาย",
  },
];

export const Groups = [
  {
    key: "หน่วยวิเทศสัมพันธ์",
    label: "หน่วยวิเทศสัมพันธ์",
    icon: "public",
    color: "blue",
  },
  {
    key: "หน่วยบริหารงานวิจัยและนวัตกรรม",
    label: "หน่วยบริหารงานวิจัยและนวัตกรรม",
    icon: "science",
    color: "purple",
  },
  {
    key: "งานบริการการศึกษาและพัฒนาคุณภาพนักศึกษา",
    label: "งานบริการการศึกษาและพัฒนาคุณภาพนักศึกษา",
    icon: "school",
    color: "indigo",
  },
  {
    key: "หน่วยทรัพยากรบุคคล",
    label: "หน่วยทรัพยากรบุคคล",
    icon: "groups",
    color: "pink",
  },
  {
    key: "งานการเงิน การคลังและพัสดุ",
    label: "งานการเงิน การคลังและพัสดุ",
    icon: "account_balance_wallet",
    color: "green",
  },
  {
    key: "หน่วยงานสารบรรณและเลขาหน่วยงาน",
    label: "หน่วยงานสารบรรณและเลขาหน่วยงาน",
    icon: "description",
    color: "orange",
  },
  {
    key: "หน่วยบริการวิชาการสัตวแพทย์เพื่อสังคม",
    label: "หน่วยบริการวิชาการสัตวแพทย์เพื่อสังคม",
    icon: "pets",
    color: "teal",
  },
  {
    key: "หน่วยรับฟังเสียงลูกค้า",
    label: "หน่วยรับฟังเสียงลูกค้า",
    icon: "support_agent",
    color: "cyan",
  },
  {
    key: "หน่วยนโยบายและแผน",
    label: "หน่วยนโยบายและแผน",
    icon: "analytics",
    color: "amber",
  },
  {
    key: "หน่วยประชาสัมพันธ์และภาพลักษณ์องค์กร",
    label: "หน่วยประชาสัมพันธ์และภาพลักษณ์องค์กร",
    icon: "campaign",
    color: "red",
  },
  {
    key: "งานบริหารทั่วไป",
    label: "งานบริหารทั่วไป",
    icon: "business_center",
    color: "lime",
  },
  {
    key: "หน่วยอาคารและยานพาหนะ",
    label: "หน่วยอาคารและยานพาหนะ",
    icon: "engineering",
    color: "brown",
  },
  {
    key: "หน่วยกายภาพ สิ่งแวดล้อมและเทคโนโลยีสารสนเทศ",
    label: "หน่วยกายภาพ สิ่งแวดล้อมและเทคโนโลยีสารสนเทศ",
    icon: "computer",
    color: "deep-purple",
  },
  {
    key: "หน่วยประกันคุณภาพการศึกษา",
    label: "หน่วยประกันคุณภาพการศึกษา",
    icon: "verified",
    color: "deep-orange",
  },
];
